---
kind: other
id: Methods.T:Autodesk.Revit.DB.AssemblyCodeTable
source: html/8fb914ba-4751-4111-c176-4f72611c7881.htm
---
# AssemblyCodeTable Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.